'use strict';

module.exports = {
  TITLES: [
    `Продам книги Стивена Кинга`,
    `Продам новую приставку Sony Playstation 5`,
    `Продам отличную подборку фильмов на VHS`,
    `Куплю антиквариат`,
    `Куплю породистого кота`,
  ],

  SENTENCES: [
    `Товар в отличном состоянии.`,
    `Пользовались бережно и только по большим праздникам.`,
    `Продаю с болью в сердце...`,
    `Бонусом отдам все аксессуары.`,
    `Даю недельную гарантию.`,
    `Если товар не понравится — верну всё до последней копейки.`,
    `Это настоящая находка для коллекционера!`,
    `Если найдёте дешевле — сброшу цену.`,
    `Таких предложений больше нет!`,
    `При покупке с меня бесплатная доставка в черте города.`,
  ],

  CATEGORIES: [
    `Книги`,
    `Разное`,
    `Посуда`,
    `Игры`,
    `Животные`,
    `Журналы`,
  ],

  OfferType: {
    OFFER: `offer`,
    SALE: `sale`,
  },

  SumRestrict: {
    MIN: 1000,
    MAX: 100000,
  },

  PictureRestrict: {
    MIN: 0,
    MAX: 16,
  }
};

